## Importing Packages

In [8]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

%matplotlib inline

## Reading in datasets

In [9]:
aging_data = pd.read_csv('../data/Alzheimer_s_Disease_And_Healthy_Aging_Data.csv')
cog_dec = pd.read_csv('../data/Alzheimer_s_Disease_and_Healthy_Aging_Indicators__Cognitive_Decline.csv')
caregiving =  pd.read_csv('../data/Alzheimer_s_Disease_and_Healthy_Aging_Indicators__Caregiving.csv')
american_indian_female = pd.read_csv('../data/American Indian or Alaskan Native, Female, AD by State.csv')
american_indian_male = pd.read_csv('../data/American Indian or Alaskan Native, Male, AD by State.csv')
asian_male = pd.read_csv('../data/Asian or PI, Male, AD by State.csv')
asian_female = pd.read_csv('../data/Asian or PI, Female, AD by State.csv')
black_male = pd.read_csv('../data/Black, Male, AD by State.csv')
black_female = pd.read_csv('../data/Black, Female, AD by State (1).csv')
cumulative_72020 = pd.read_csv('../data/Cumulative_Provisional_Death_Counts_by_Sex__Race__and_Age_through_7_4_2020.csv')
hispanic_male = pd.read_csv('../data/Hispanic, Male, AD by State.csv')
hispanic_female = pd.read_csv('../data/Hispanic, Female, AD by State.csv')
multiple_causes = pd.read_csv('../data/Multiple Cause of Death, 1999-2018.csv')
white_male = pd.read_csv('../data/White, Male, AD by State.csv')
white_female = pd.read_csv('../data/White, Female, AD by State.csv')

In [10]:
caregiving.shape

(15428, 38)

In [11]:
white_male.shape

(14374, 9)

In [12]:
white_female.shape

(15378, 10)

## Data and Column Cleanup

In [13]:
white_female.head(10)

,Notes,State,Five-Year Age Groups,Gender,Ethnicity,Year,Year Code,Deaths,Population,Crude Rate
0,NaN,Alabama,30-34,Female,White,1999.0,1999.0,Suppressed,106046,Suppressed
1,NaN,Alabama,30-34,Female,White,2000.0,2000.0,Suppressed,105657,Suppressed
2,NaN,Alabama,30-34,Female,White,2001.0,2001.0,Suppressed,105165,Suppressed
3,NaN,Alabama,30-34,Female,White,2002.0,2002.0,Suppressed,104248,Suppressed
4,NaN,Alabama,30-34,Female,White,2003.0,2003.0,Suppressed,102860,Suppressed
5,NaN,Alabama,30-34,Female,White,2004.0,2004.0,Suppressed,100674,Suppressed
6,NaN,Alabama,30-34,Female,White,2005.0,2005.0,Suppressed,97726,Suppressed
7,NaN,Alabama,30-34,Female,White,2006.0,2006.0,Suppressed,94084,Suppressed
8,NaN,Alabama,30-34,Female,White,2007.0,2007.0,Suppressed,92274,Suppressed
9,NaN,Alabama,30-34,Female,White,2008.0,2008.0,Suppressed,92014,Suppressed

In [9]:
white_female.shape

(15378, 8)

In [10]:
white_female.head()

,Notes,State,Five-Year Age Groups,Gender,Year,Deaths,Population,Crude Rate
0,NaN,Alabama,30-34 years,Female,1999.0,Suppressed,106046,Suppressed
1,NaN,Alabama,30-34 years,Female,2000.0,Suppressed,105657,Suppressed
2,NaN,Alabama,30-34 years,Female,2001.0,Suppressed,105165,Suppressed
3,NaN,Alabama,30-34 years,Female,2002.0,Suppressed,104248,Suppressed
4,NaN,Alabama,30-34 years,Female,2003.0,Suppressed,102860,Suppressed

In [15]:
white_male.head()

,Notes,State,Five-Year Age Groups Code,Gender,Ethnicity,Year,Deaths,Population,Crude Rate
0,NaN,Alabama,35-39,Male,White,1999.0,Suppressed,123893,Suppressed
1,NaN,Alabama,35-39,Male,White,2000.0,Suppressed,122289,Suppressed
2,NaN,Alabama,35-39,Male,White,2001.0,Suppressed,117693,Suppressed
3,NaN,Alabama,35-39,Male,White,2002.0,Suppressed,113632,Suppressed
4,NaN,Alabama,35-39,Male,White,2003.0,Suppressed,110121,Suppressed